In [1]:
print("""
@Description: examining the distribution of features and targets
@Author(s): Stephen CUI
@LastEditor(s): Stephen CUI
@CreatedTime: 2023-07-21 19:52:40
""")

@Description: examining the distribution of features and targets
@Author(s): Stephen CUI
@LastEditor(s): Stephen CUI
@CreatedTime: 2023-07-21 19:52:40

# subsetting data

In [2]:
import numpy as np
import pandas as pd
nls97 = pd.read_csv('data/nls97.csv', index_col='personid')

In [3]:
demo_cols = ['gender', 'birthyear', 'maritalstatus', 'weeksworked16',
             'wageincome', 'highestdegree']

In [4]:
nls97_demo = nls97[demo_cols]
nls97_demo.index.name

'personid'

In [8]:
nls97_demo[1000:1004].T

personid             195884          195891         195970         195996
gender                 Male            Male         Female         Female
birthyear              1981            1980           1982           1980
maritalstatus           NaN   Never-married  Never-married            NaN
weeksworked16           NaN            53.0           53.0            NaN
wageincome              NaN         14000.0        52000.0            NaN
highestdegree  4. Bachelors  2. High School   4. Bachelors  3. Associates

In [9]:
nls97_demo[1000:1004:2].T

personid             195884         195970
gender                 Male         Female
birthyear              1981           1982
maritalstatus           NaN  Never-married
weeksworked16           NaN           53.0
wageincome              NaN        52000.0
highestdegree  4. Bachelors   4. Bachelors

In [10]:
nls97_demo[:3]

,gender,birthyear,maritalstatus,weeksworked16,wageincome,highestdegree
personid,,,,,,
100061,Female,1980,Married,48.0,12500.0,2. High School
100139,Male,1983,Married,53.0,120000.0,2. High School
100284,Male,1984,Never-married,47.0,58000.0,0. None

In [11]:
nls97_demo.head(3)

,gender,birthyear,maritalstatus,weeksworked16,wageincome,highestdegree
personid,,,,,,
100061,Female,1980,Married,48.0,12500.0,2. High School
100139,Male,1983,Married,53.0,120000.0,2. High School
100284,Male,1984,Never-married,47.0,58000.0,0. None

In [12]:
nls97_demo[-3:]

,gender,birthyear,maritalstatus,weeksworked16,wageincome,highestdegree
personid,,,,,,
999543,Female,1984,Divorced,0.0,NaN,2. High School
999698,Female,1983,Never-married,0.0,NaN,2. High School
999963,Female,1982,Married,53.0,50000.0,4. Bachelors

In [13]:
nls97_demo.tail(3)

,gender,birthyear,maritalstatus,weeksworked16,wageincome,highestdegree
personid,,,,,,
999543,Female,1984,Divorced,0.0,NaN,2. High School
999698,Female,1983,Never-married,0.0,NaN,2. High School
999963,Female,1982,Married,53.0,50000.0,4. Bachelors

In [15]:
nls97_demo.loc[[195884, 195891, 195970]]

,gender,birthyear,maritalstatus,weeksworked16,wageincome,highestdegree
personid,,,,,,
195884,Male,1981,NaN,NaN,NaN,4. Bachelors
195891,Male,1980,Never-married,53.0,14000.0,2. High School
195970,Female,1982,Never-married,53.0,52000.0,4. Bachelors

In [16]:
nls97_demo.loc[195884:195970]

,gender,birthyear,maritalstatus,weeksworked16,wageincome,highestdegree
personid,,,,,,
195884,Male,1981,NaN,NaN,NaN,4. Bachelors
195891,Male,1980,Never-married,53.0,14000.0,2. High School
195970,Female,1982,Never-married,53.0,52000.0,4. Bachelors

In [17]:
nls97_demo.iloc[[0, 1, 2]]

,gender,birthyear,maritalstatus,weeksworked16,wageincome,highestdegree
personid,,,,,,
100061,Female,1980,Married,48.0,12500.0,2. High School
100139,Male,1983,Married,53.0,120000.0,2. High School
100284,Male,1984,Never-married,47.0,58000.0,0. None

In [18]:
nls97_demo.iloc[0:3]

,gender,birthyear,maritalstatus,weeksworked16,wageincome,highestdegree
personid,,,,,,
100061,Female,1980,Married,48.0,12500.0,2. High School
100139,Male,1983,Married,53.0,120000.0,2. High School
100284,Male,1984,Never-married,47.0,58000.0,0. None

In [19]:
nls97_demo.iloc[-3:]

,gender,birthyear,maritalstatus,weeksworked16,wageincome,highestdegree
personid,,,,,,
999543,Female,1984,Divorced,0.0,NaN,2. High School
999698,Female,1983,Never-married,0.0,NaN,2. High School
999963,Female,1982,Married,53.0,50000.0,4. Bachelors

In [21]:
nls97['nightlyhrssleep'].head()

personid
100061    6.0
100139    8.0
100284    7.0
100292    NaN
100583    6.0
Name: nightlyhrssleep, dtype: float64

In [25]:
low_sleep_threshold = nls97['nightlyhrssleep'].quantile(.33)
low_sleep_threshold

6.0

In [27]:
sleep_check_mask = nls97['nightlyhrssleep'] <= low_sleep_threshold
sleep_check_mask.head()

personid
100061     True
100139    False
100284    False
100292    False
100583     True
Name: nightlyhrssleep, dtype: bool

In [28]:
sleep_check_mask.index.equals(nls97.index)

True

In [30]:
low_sleep = nls97.loc[sleep_check_mask]
low_sleep.shape

(3067, 88)

In [31]:
low_sleep = nls97.loc[nls97['nightlyhrssleep'] <= low_sleep_threshold]
low_sleep.shape

(3067, 88)

In [33]:
low_sleep_3_plus_children = nls97.loc[(nls97['nightlyhrssleep'] <= low_sleep_threshold) & (nls97['childathome'] >= 3)]
low_sleep_3_plus_children.shape

(623, 88)